app/controllers/posts_controller.rb

INSERT INTO "posts" ("Title", "Body", "created_at", "updated_at") VALUES ('2nd Post', 'The basic package for Baby Naming Invitations includes personalized invitations and envelopes printed with your return address. Hebrew text is available. You will have the opportunity to view an on line proof before we go to print. Coordinated response cards, reception cards, place cards, map details, direction cards, programs, pamphlets and thank you cards are also available. Call toll free 888-286-0365 for further information.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "updated_at" = '2013-09-13 13:12:18.948109', "Body" = 'This is my first post!! Can I Still editit' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])